from django.shortcuts import render

# Create your views here.
def services(request):
    context = {
        'image_service': '1.png',
        'title_service': 'Кримінальна практика',
        'count_service': 3400,
        'another_services': [
            'Адміністративна практика',
            'Міграційні послуги',
            'Цивільна практика',
            'Інтелектуальна власність',
            'Податкова практика',
            'Військове право',
            'Адвокат для бізнесу',
            'Трудове право',
        ],
        'about_service': 'Справи у кримінальному праві - це складний та всебічний процес, що охоплює як розслідування злочину, так і його судовий розгляд.Одноосібне протистояння позиції сторони обвинувачення може обернутися для вас катастрофою. Слідство володіє значним арсеналом методів впливу, а у вас, ймовірно, не буде ані необхідних правових інструментів, ані знань процесуального законодавства, щоб адекватно захищати свої права та інтереси. Звернувшись до компетентного кримінального адвоката, ви отримуєте професійну допомогу і позбавлення від тиску з боку органів слідства.',
        'list_what_get': [
            {
                'title': 'Аналіз законодавчої бази:',
                'list': [
                    'Огляд ключових положень Закону України "Про мобілізаційну підготовку та мобілізацію", а також змін, внесених у зв’язку з воєнним станом.',
                    'Роз’яснення указів Президента України та постанов Кабінету Міністрів, які регулюють мобілізаційні заходи станом на березень 2025 року.'
                ]
            },
            {
                'title': 'Хто підлягає мобілізації:',
                'list': [
                    'Детальний розбір вікових категорій, стану здоров’я та інших критеріїв, які впливають на призов.',
                    'Інформація про спеціальні категорії громадян: студенти, батьки багатодітних сімей, єдині годувальники, працівники критичної інфраструктури тощо.'
                ]
            },
            {
                'title': 'Підстави для відстрочки та звільнення:',
                'list': [
                    'Перелік законних причин для отримання відстрочки (сімейні обставини, стан здоров’я, бронювання на роботі).',
                    'Порядок оформлення документів для підтвердження права на відстрочку чи звільнення від призову.'
                ]
            },
            {
                'title': 'Порядок дій при отриманні повістки:',
                'list': [
                    'Види повісток та їх юридична сила: що робити, якщо повістку вручили неналежним чином?',
                    'Ваші права та обов’язки під час проходження медкомісії та явки до військкомату.'
                ]
            },
            {
                'title': 'Захист від порушень:',
                'list': [
                    'Як оскаржити незаконні дії працівників ТЦК та СП (територіальних центрів комплектування та соціальної підтримки).',
                    'Порядок подання скарг та звернень до суду у разі порушення ваших прав.',
                    'Приклади реальних ситуацій та способи їх вирішення.'
                ]
            },
            {
                'title': 'Індивідуальні відповіді:',
                'list': [
                    'Можливість поставити запитання, які стосуються саме вашої ситуації: від перевірки документів до підготовки до судового розгляду.'
                ]
            }
        ]
    }
    return render(request, 'service/service.html', context)