from django.http import HttpResponse
from django.shortcuts import render

from services.models import Service
from main.models import Review

# Create your views here.
def index(request):

    services = Service.objects.filter(service_type='service').only('title', 'slug', 'image')
    consultations = Service.objects.filter(service_type='consultation').only('title', 'slug', 'image')
    rewiews = Review.objects.all()

    context = {
        'services': services,

        'consultations': consultations,

        'reviews': rewiews,
    }
    return render(request, 'main/index.html', context)

def about(request):
    context = {
        
    }
    return render(request, 'main/about_me.html')

def conditioning_policy(request):
    context = {
        'about_policy': 'Ця Політика конфіденційності (надалі – «Політика») пояснює, як адвокат Ольга Бардадим (надалі – «Адвокат», «ми», «нас») збирає, використовує, зберігає та захищає персональні дані клієнтів, відвідувачів сайту та інших осіб, які взаємодіють із нами через веб-сайт <a href="https://example.com">example.com</a> (надалі – «Сайт»). Ми поважаємо ваше право на конфіденційність і діємо відповідно до Закону України «Про захист персональних даних» та інших застосовних нормативних актів.',
        'elements_policy': [
            {
                'title': '1. Які дані ми збираємо?',
                'first_text': 'Ми можемо збирати такі категорії персональних даних:',
                'list': [
                    '<strong>Контактна інформація:</strong> ім’я, прізвище, номер телефону, адреса електронної пошти, адреса проживання (за необхідності).',
                    '<strong>Дані, надані добровільно:</strong> інформація, яку ви надаєте під час заповнення форм на Сайті (наприклад, при замовленні консультації), а також через електронне листування чи телефонні дзвінки.',
                    '<strong>Технічні дані:</strong> IP-адреса, тип браузера, дані про пристрій, файли cookie, час відвідування Сайту та інші технічні дані, зібрані автоматично.',
                    '<strong>Інші дані:</strong> інформація, необхідна для надання юридичних послуг, наприклад, деталі вашої справи, документи чи інші відомості, які ви передаєте нам для виконання юридичних завдань.'
                ],
                'second_text': None
            },
            {
                'title': '2. Мета збору та використання даних',
                'first_text': 'Ми використовуємо ваші персональні дані для таких цілей:',
                'list': [
                    'Надання юридичних послуг, включаючи консультації, підготовку документів та представництво ваших інтересів.',
                    'Зв’язок із вами для уточнення деталей, відповідей на запити чи організації консультацій.',
                    'Покращення роботи Сайту та наших послуг шляхом аналізу технічних даних.',
                    'Виконання вимог законодавства, наприклад, для документування надання юридичних послуг.',
                    'Надсилання інформаційних повідомлень (за вашої згоди), таких як оновлення про юридичні послуги чи зміни в законодавстві.'
                ],
                'second_text': None
            },
            {
                'title': '3. Правова основа обробки даних',
                'first_text': 'Обробка ваших персональних даних здійснюється на таких підставах:',
                'list': [
                    'Ваша згода, надана під час заповнення форм на Сайті або укладення договору про надання юридичних послуг.',
                    'Необхідність виконання договору, стороною якого ви є (наприклад, надання юридичних послуг).',
                    'Дотримання законних зобов’язань Адвоката, передбачених законодавством України.',
                    'Захист законних інтересів Адвоката або третіх осіб, якщо це не порушує ваші права та свободи.'
                ],
                'second_text': None
            },
            {
                'title': '4. Передача даних третім особам',
                'first_text': 'Ми не передаємо ваші персональні дані третім особам, за винятком таких випадків:',
                'list': [
                    'Якщо це необхідно для надання юридичних послуг (наприклад, передача даних до суду чи інших державних органів за вашою справою).',
                    'На вимогу правоохоронних чи інших державних органів відповідно до законодавства.',
                    'З вашої явної згоди на передачу даних (наприклад, для залучення експертів чи інших спеціалістів).'
                ],
                'second_text': 'У разі передачі даних ми забезпечуємо їх захист та укладаємо відповідні договори з отримувачами даних, щоб гарантувати їх конфіденційність.'
            },
            {
                'title': '5. Зберігання та захист даних',
                'first_text': 'Ми зберігаємо ваші персональні дані лише протягом періоду, необхідного для досягнення цілей, описаних у цій Політиці, або відповідно до вимог законодавства. Для захисту ваших даних ми використовуємо:',
                'list': [
                    'Технічні заходи: шифрування, захист від несанкціонованого доступу, використання безпечних серверів.',
                    'Організаційні заходи: обмеження доступу до даних лише для уповноважених осіб, які зобов’язані дотримуватися конфіденційності.'
                ],
                'second_text': None
            },
            {
                'title': '6. Ваші права',
                'first_text': 'Відповідно до Закону України «Про захист персональних даних», ви маєте право:',
                'list': [
                    'Знати про джерела збору, місце зберігання та цілі обробки ваших даних.',
                    'Вимагати доступу до ваших персональних даних.',
                    'Вимагати виправлення неточних або неповних даних.',
                    'Вимагати видалення ваших даних, якщо вони більше не потрібні для зазначених цілей або якщо ви відкликали згоду на їх обробку.',
                    'Заперечувати проти обробки ваших даних за певних умов.',
                    'Подавати скарги до Уповноваженого Верховної Ради України з прав людини щодо обробки ваших даних.'
                ],
                'second_text': 'Для реалізації цих прав звертайтеся до нас за контактами, зазначеними нижче.'
            },
            {
                'title': '7. Використання файлів cookie',
                'first_text': 'Сайт використовує файли cookie для покращення вашого досвіду користування. Cookie дозволяють нам аналізувати відвідування Сайту та оптимізувати його роботу. Ви можете вимкнути використання cookie у налаштуваннях вашого браузера, але це може вплинути на функціональність Сайту.',
                'list': [],
                'second_text': None
            },
            {
                'title': '8. Зміни до Політики конфіденційності',
                'first_text': 'Ми можемо періодично оновлювати цю Політику, щоб відобразити зміни в законодавстві чи наших практиках обробки даних. Про суттєві зміни ми повідомимо вас через Сайт або за допомогою інших засобів зв’язку.',
                'list': [],
                'second_text': None
            },
            {
                'title': '9. Контактна інформація',
                'first_text': 'Якщо у вас є питання щодо цієї Політики або обробки ваших персональних даних, звертайтеся до нас:',
                'list': [
                    '<strong>Адвокат:</strong> Ольга Бардадим',
                    '<strong>Телефон:</strong> +380 81 123 4567',
                    '<strong>Email:</strong> [email protected]',
                    '<strong>Адреса:</strong> вул. Центральна, 123, Київ, Україна',
                ],
                'second_text': None
            }
        ],
        'date_updated': 'Останнє оновлення: 27.05.2025'
    }
    return render(request, 'main/conditioning_policy.html', context)